examples/milestone_unv_192_168_1_104/media2/GetOSDOptions.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
	xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
	xmlns:wsa5="http://www.w3.org/2005/08/addressing">
	<SOAP-ENV:Header>
		<wsse:Security SOAP-ENV:mustUnderstand="true">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">p17PZGv2M4N/2R/w/+zpMGdI/jQ=</wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GbNJab2dFLAICnoZzaIXJKumXTg=</wsse:Nonce>
				<wsu:Created>2025-12-22T21:07:37Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tr2:GetOSDOptions>
			<tr2:ConfigurationToken>video_source_config1</tr2:ConfigurationToken>
		</tr2:GetOSDOptions>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>